import React from 'react';
import { Button } from "antd";
import { HashRouter, Route, Switch, Link } from "react-router-dom";
class History extends React.Component {
    render() {
        return (
            <body >
                <div>
                    <div class="bg1">
                        <h2>
                            协会历史
                </h2>
                        <div class="para" label-module="para">浙江大学学生E志者协会的前身是1984年陈强先生创办的电器工程学院电气维修小组。</div>
                        <div class="para" label-module="para">步入21世纪，为适应新时期学校教育体制的改革和管理模式的创新，在电气工程学院团委的大力支持和推动下，电器维修小组终于在2008年9月正式成为校级学生社团，面向全校吸纳志愿维修的志愿者，在全校范围内搭建以志愿维修为主体的服务平台，做志愿维修的践行者，做安全用电和节约用电的实践者和宣传者，做电力热点问题及电器电脑新尖问题的引领者。</div>
                        <div class="para" label-module="para">在此后，协会抓紧机遇，在做好本职工作的同时，积极开拓其他公益志愿活动，服务广大师生与社会群众。多年来，协会还在组织架构、运行管理机制、文化建设、对外宣传等方面展开了积极的探索，开展了多项校级精品活动，提高了协会在校园文化中的知名度和影响力。</div>
                        <div class="para" label-module="para">近五年来，浙江大学学生E志者协会凭借出色的表现，屡次获得“浙江大学校级优秀社团”、“校级十佳社团”、“青年志愿服务优秀集体”等荣誉称号。2015年4月，浙江大学E志者协会荣升为校四星级社团。2016年6月，浙江大学学生E志者协会获评“浙江大学学生示范性社团”，该奖项是浙江大学社团最高荣誉。</div>
                        <div class="para" label-module="para">浙江大学学生E志者协会是浙江大学位数不多的拥有自己办公室的社团之一，为社团活动提供了良好载体，办公室位于紫金港校区东三教学楼200室，供社团日常值班维修和社团活动使用。</div>
                    </div>


                    <div class="bg2">
                        <h2>
                            活动回顾
                </h2>


                        <div class="para" label-module="para"><b>校园维修&amp;社区维修</b></div>
                        <div class="para" label-module="para">协会日常值班维修，每月一次的学园义务维修和不定期开展的社区义务维修为同学们和社区居民的生活带来了极大的便利。</div>
                        <div class="para" label-module="para"><b>电脑电器维修知识课堂（社联精品课程）</b></div>
                        <div class="para" label-module="para">协会每个长学期都会开办电脑电器维修知识精品课程，旨在传授对于电脑电器维修感兴趣的同学相关的知识并交流经验，方便同学们自主解决生活中遇到的简单的电脑电器故障。2015年秋冬学期精品课程荣获浙江大学学生社团精品课程评比一等奖。</div>
                        <div class="para" label-module="para"><b>浙江大学学生E志者协会30周年庆典暨电气工程学院公益论坛</b></div>
                        <div class="para" label-module="para">协会向全校师生展示30年来E志者们在公益实践中取得的成果，同时也邀请到了校内大型公益组织的代表们分享他们的公益之路。活动一经举办，即在全校范围内掀起了热心公益实践</div>
                        <div class="para" label-module="para">的巨大浪潮，激发了广大青年学子的投身公益事业的热情，点亮了大学生心中公益实践的明灯。</div>
                    </div>
                    <div class="bg">
                        <h2>
                            协会日常
                    </h2>
                        <div class="para" label-module="pare">
                            浙江大学E志者协会，其宗旨为“以服务社会为己任，搭建电器维修爱好者交流平台，做安全用电和节约用电的实践者和宣传者，研究电力电气热点问题，为建设社会主义和谐社会贡献力量。”</div>
                        <div class="para" label-module="pare">
                            在过去的三十年里，协会一如既往的做好自己的最本职工作——<b>免费电器维修</b>，服务于广大的师生；并在各方面展开了积极的探索，开展了多项校级精品活动。
        协会活动主要分为以下三大部分：
                        <pre>

                            </pre>
                            <h3 class="titleh3">
                                一、公益活动
                        </h3>
                            <pre>

                            </pre>
                            <div class="para" ><b>日常值班</b>：协会在日常服务中，为满足校内师生日常维修需求、提高志愿维修质量与效率，特设立了值班制度，每天固定值班时间超过6小时，为同学们提供免费维修电脑电器的服务。在刚刚过去的2014-2015学年，协会在校内共进行电脑清灰247次，维修电脑硬件软件问题共计794次，维修大小电器共计145件，电脑维修成功率达到90.7%，电器维修成功率达到81.3%。</div>
                            <div class="para">
                                <b>线上交流：</b>近三年，协会始终坚持通过各类平台发布指导购买笔记本的帖子，为广大新生以及全校师生提供购机基础知识普及以及免费的购机咨询。协会官方微信平台每周推送有关电脑电器及前沿科技的推文，在及时为全校师生解决电脑电器疑惑的过程中承担起普及科学技术知识的任务。
                            </div>
                            <div class="para">
                                <b>社会实践：</b>在80年代，我们就已经开展社区维修服务，也深入少年宫、社区夏令营等场所向青少年讲解相关知识。此外，我们还积极参加诸如长三角高校公益论坛等社会性的公益活动，并积极与在杭其他高校拓展合作关系，曾作为代表受邀奔赴浙江工商大学参加电脑维修交流峰会，并发表重要讲话。
                       </div>
                            <pre>

                            </pre>
                            <h3 class="titleh3">
                                二、社团活动</h3>
                            <pre>

                            </pre>
                            <div class="para">浙江大学学生E志者协会努力追求发展成一家展现大学生风貌，发扬电气特色的优秀公益社团，开展如电路板焊接、全息投影等内容详实、寓教于乐的实践类活动。</div>
                            <div class="para">协会每年推陈出新，举办了形式内容各异、特点鲜明的精品活动，如“电路的特技”，鼓励同学自行设计新奇的电路并进行自主焊接；“功放传心声”DIY大赛让同学现场焊接可传声的电路并传达自己的心声；“地球一小时”：向全校师生传播正确用电、合理节电小常识；“全息投影DIY烙铁画”：利用自制全息投影技术让同学体验用烙铁作画的乐趣……这一系列形式多样、独具协会特色的精品活动，吸引了一大批同学的参与，获得了同学们的一致好评。</div>
                            <pre>

                            </pre>
                            <h3 class="titleh3">三：创新创意</h3>
                            <pre>

                            </pre>
                            <div class="para">在日常维修中，我们基于网络、创新方法，通过理论和实践的结合提升自己的能力，如通过自主实践编写命令提示符批处理文件解决一些系统问题、通过沙箱模拟研究校园流行病毒攻击原理并找出源头。同时关注切合当代大学生实际的前沿技术，曾撰写《windows10测评报告》、《office2016评测》、《2016年暑假购机指南》文件，将所学前沿科技知识应用于日常维修实践。</div>
                            <div class="para">同时每年，协会均会组织中高年级成员组队参加智能车竞赛，与智能车基地保持联系，在技术难题上交换经验。协会还举办废旧电子元件（电器）创意DIY大赛，面向全校同学征集创意，充分发挥动手实践能力，在校内推广电器创意创新的理念。协会还曾受邀参加中国大学生创意节（杭州赛区）活动，荣获“创意装饰奖”。</div>
                        </div>
                    </div>

                    <a href='./'>
                        <Button type="primary" size={"large"}>to home</Button>
                    </a>
                </div>
            </body>



        )
    }
}
export default History